
public class Test1 {

	public static void main(String[] args) {
//		p39 컴퓨터 수 표현 방법
//		반도체 신호 꺼짐 0 / 켜짐 1
//		0, 1 표현하는 최소 단위 => 1비트(bit)
//		8비트 => 1바이트(byte)
//		10진수 9999 => 9*1000 + 9*100 + 9*10 + 9*1
//		       => 9*10의3승 + 9*10의2승 + 9*10의1승 + 9*10의0승
//		2진수  1111 => 1*2의3승 + 1*2의2승 + 1*2의1승 + 1*2의0승
//		           => 8 + 4 + 2 + 1
		
//		8진수  77 => 7*8의1승 + 7*8의0승 => 56 + 7
//		16진수 ff => 0 ~9 10 a  11 b  12 c 13 d 14 e 15 f 
//		         =>  15*16의1승 + 15*16의0승 => 15*16 + 15
		
//		10진수 5 => 음수 표현 -5  => 더하면 0
//		2진수 5(0000 0101)
//		=> 음수 표현 -5 => 2의 보수 (0->1,1->0, + 1)
//		              => (1111 1010 + 1) => (1111 1011)
//		=> (0000 0101)
//		  +(1111 1011)
//		=> 10000 0000
		
//		3 -> -3  => 0
//		
		
		
		int num= 10;
		int bNum = 0b1010;
		int octNum =012;
		int hexNum = 0xA;
		
		System.out.println("10진수 : "+num);
		System.out.println("2진수 : "+bNum);
		System.out.println("8진수 : "+octNum);
		System.out.println("16진수 : "+hexNum);

	}

}
